#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.function_apps.module.function_app_support_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_apps.module.function_app_user_autoscaler_02.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.iam.module.admins_roles["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|owner"] will be destroyed
  # (because key ["iopitnwalletst01|*|owner"] is not in for_each map)
  - resource "azurerm_role_assignment" "queue" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01/providers/Microsoft.Authorization/roleAssignments/1b49bd6d-05d1-d8bb-8269-e7869dcd5578" -> null
      - name                 = "1b49bd6d-05d1-d8bb-8269-e7869dcd5578" -> null
      - principal_id         = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/974c5e8b-45b9-4653-ba55-5f855dd0fb88" -> null
      - role_definition_name = "Storage Queue Data Contributor" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01" -> null
    }

  # module.iam.module.admins_roles["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|owner|Storage Queue Data Contributor"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.admins_roles["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|reader"] will be destroyed
  # (because key ["iopitnwalletst01|*|reader"] is not in for_each map)
  - resource "azurerm_role_assignment" "queue" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01/providers/Microsoft.Authorization/roleAssignments/1a31545c-1d95-8b9c-5a51-7955a9147a87" -> null
      - name                 = "1a31545c-1d95-8b9c-5a51-7955a9147a87" -> null
      - principal_id         = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/8a0f0c08-91a1-4084-bc3d-661d67233fed" -> null
      - role_definition_name = "Storage Queue Data Message Processor" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01" -> null
    }

  # module.iam.module.admins_roles["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|reader|Storage Queue Data Message Processor"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Processor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  + resource "azurerm_role_assignment" "queue" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.admins_roles["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|writer"] will be destroyed
  # (because key ["iopitnwalletst01|*|writer"] is not in for_each map)
  - resource "azurerm_role_assignment" "queue" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01/providers/Microsoft.Authorization/roleAssignments/097218ee-34eb-fb48-eaf8-ef25d3104cc0" -> null
      - name                 = "097218ee-34eb-fb48-eaf8-ef25d3104cc0" -> null
      - principal_id         = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/c6a89b2d-59bc-44d0-9896-0f6e12d7b80a" -> null
      - role_definition_name = "Storage Queue Data Message Sender" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01" -> null
    }

  # module.iam.module.admins_roles["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|writer|Storage Queue Data Message Sender"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Sender"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|owner"] will be destroyed
  # (because key ["iopitnwalletst01|*|owner"] is not in for_each map)
  - resource "azurerm_role_assignment" "queue" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01/providers/Microsoft.Authorization/roleAssignments/a1745158-b12f-a693-4dc8-f7a407a1ae0c" -> null
      - name                 = "a1745158-b12f-a693-4dc8-f7a407a1ae0c" -> null
      - principal_id         = "32544b2f-b97d-4453-9555-1ad71630512c" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/974c5e8b-45b9-4653-ba55-5f855dd0fb88" -> null
      - role_definition_name = "Storage Queue Data Contributor" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01" -> null
    }

  # module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|owner|Storage Queue Data Contributor"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "32544b2f-b97d-4453-9555-1ad71630512c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|reader"] will be destroyed
  # (because key ["iopitnwalletst01|*|reader"] is not in for_each map)
  - resource "azurerm_role_assignment" "queue" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01/providers/Microsoft.Authorization/roleAssignments/770b0ec1-8279-efa2-8d90-3c072a035e21" -> null
      - name                 = "770b0ec1-8279-efa2-8d90-3c072a035e21" -> null
      - principal_id         = "32544b2f-b97d-4453-9555-1ad71630512c" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/8a0f0c08-91a1-4084-bc3d-661d67233fed" -> null
      - role_definition_name = "Storage Queue Data Message Processor" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01" -> null
    }

  # module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|reader|Storage Queue Data Message Processor"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "32544b2f-b97d-4453-9555-1ad71630512c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Processor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  + resource "azurerm_role_assignment" "queue" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "32544b2f-b97d-4453-9555-1ad71630512c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|writer"] will be destroyed
  # (because key ["iopitnwalletst01|*|writer"] is not in for_each map)
  - resource "azurerm_role_assignment" "queue" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01/providers/Microsoft.Authorization/roleAssignments/f0e59230-8042-008c-7ae2-0a1391a371ce" -> null
      - name                 = "f0e59230-8042-008c-7ae2-0a1391a371ce" -> null
      - principal_id         = "32544b2f-b97d-4453-9555-1ad71630512c" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/c6a89b2d-59bc-44d0-9896-0f6e12d7b80a" -> null
      - role_definition_name = "Storage Queue Data Message Sender" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01" -> null
    }

  # module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|writer|Storage Queue Data Message Sender"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "32544b2f-b97d-4453-9555-1ad71630512c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Sender"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 8 to add, 0 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
